<template>
	<div class="task-block">
		<h1>SimbirSoft</h1>
		<h2>
			Входное тестовое задание на поток Frontend <br />Приложение SoccerStat
		</h2>
		<h3>Необходимо:</h3>
		<p>
			Разработать приложение/web страницу для просмотра спортивной статистики.
		</p>
		<h2>Требования к заданию:</h2>
		<p>Обязательные технологии: Фреймворк React/Vuejs/Angular</p>
		<p>Допускается использовать: рациональность выбора)</p>
		<h2>Основные требования:</h2>
		<p>
			Приложение должно представлять из себя сайт просмотра статистики ведущих
			европейских турниров по футболу.
		</p>
		<ul>
			Обязательные страницы:
			<li>Список лиг/соревнований</li>
			<li>Список команд</li>
			<li>Календарь лиги - список матчей лиги/соревнования</li>
			<li>Календарь одной команды - список матчей команды</li>
		</ul>
		<p>На страницах календаря можно указать фильтр по дате (с, по)</p>
		<p>На страницах списка можно найти сущность по текстовому поиску.</p>
		<p>
			После обновления страницы данные (год, команда, поисковой запрос) должны
			сохраняться, т.е. параметры должны быть отображены в адресной строке
			(роутинг либо GET параметры)
		</p>
		<p>
			В качестве публичного API для получения данных рекомендуется использовать
			https://www.football-data.org/. Это API содержит ограничения на бесплатном
			тарифе, пользователю необходимо корректно сообщать о том, что данные не
			получены. Кандидат может использовать любое другое API при условии, что
			оно позволит получить необходимые для выполнения задания данные.
		</p>
		<h2>Требования к сдаче ТЗ:</h2>
		<p>
			Проект должен быть выложен на репозиторий GitHub, код должен быть чистым
			(желательно использовать линты и prettier для автоматического контроля), в
			индекс не должны попадать временные файлы, файлы настроек проекта и
			библиотек. Ключи к API не должны быть захардкожены - это значит что они
			должны быть вынесены в переменные окружения, в самом коде ключа быть не
			должно. Плюсом к сдаче приложения будет настроенный деплой на gh-pages
		</p>
		<ul>
			Категории оценки:
			<li>функционал (удобство интерфейса, полнота выполнения пунктов ТЗ)</li>
			<li>
				верстка (корректность отображения в браузере, наличие адаптивной версии)
			</li>
			<li>
				код (чистота кода, рациональность использования библиотек, уровень
				проработки архитектуры)
			</li>
		</ul>
	</div>
</template>

<script>
export default {};
</script>

<style scoped>
.task-block {
	max-width: 1200px;
	margin: 30px auto;
	background-color: rgba(255, 255, 255, 0.8);
	padding: 20px;
	border-radius: 5px;
	font-weight: 600;
}
h1 {
	color: #0048a0;
	font-size: 50px;
	font-weight: 700;
	text-align: center;
}
h2 {
	text-align: center;
	font-weight: 600;
	font-size: 20px;
}
ul {
	list-style: inside;
	margin-left: 25px;
}
</style>